import Footer from "../components/Footer";
import Blues from "../components/Blues";
import PageHeader from "../components/PageHeader";

// const bluesArr = [
//         {name: "이호테우해수욕장", xMap:"126.4531570913", yMap: "33.4974183784"},
//         {name: "함덕해수욕장", xMap:"126.6683567720", yMap: "33.5439000013"},
//         {name: "협재해수욕장", xMap:"126.2394418960", yMap: "33.3937764770"},
//         {name: "김녕해수욕장", xMap:"126.7596485488", yMap: "33.5566778337"},
//         {name: "곽지해수욕장", xMap:"126.3031045774", yMap: "33.4485353054"},
//         {name: "금능해수욕장", xMap:"126.2360339355", yMap: "33.3903434702"},
//         {name: "삼양해수욕장", xMap:"126.5852560795", yMap: "33.5255284819"},
//         {name: "월정리해수욕장", xMap:"126.7983896767", yMap: "33.5546536829"},
//         {name: "한담해변", xMap:"126.3101064260", yMap: "33.4627838378"},
//         {name: "신창풍차해안", xMap:"126.1739014935", yMap: "33.3434476863"},
//         {name: "중문색달해수욕장", xMap:"126.4112108397", yMap: "333.2454289066"},
//         {name: "하모해수욕장", xMap:"126.2618662177", yMap: "33.2115275274"},
//         {name: "용머리해안", xMap:"126.3108920241", yMap: "33.2338147237"},
//         {name: "광치기해변", xMap:"126.9239478125", yMap: "33.4523086956"},
//         {name: "하도해수욕장", xMap:"126.8988152454", yMap: "33.5135348561"},
//         {name: "표선해수욕장", xMap:"126.8424244429", yMap: "33.3256630271"},
//         {name: "신흥해수욕장", xMap:"126.6485444197", yMap: "33.5519793450"},
//         {name: "사계해변", xMap:"126.3084395842", yMap: "33.2282014158"},
//         {name: "화순금모래해변", xMap:"126.3335149080", yMap: "33.2407004292"},
//         {name: "남원큰엉해변", xMap:"126.703711977934", yMap: "33.2733498193692"},
//         {name: "하효쇠소깍해변", xMap:"126.6231006558", yMap: "33.2521787368"},
//         {name: "자구리담수욕장", xMap:"126.569094864082", yMap: "33.2434633730833"},
//         {name: "논짓물해변", xMap:"126.389195091938", yMap: "33.2373342754443"},
//         {name: "신양섭지해수욕장", xMap:"126.923451955302", yMap: "33.4351402005044"},
//         {name: "중문색달해수욕장", xMap:"126.4112108397", yMap: "33.2454289066"},
//         {name: "엉알해안", xMap:"126.1676196819", yMap: "33.2994219009"},
//         {name: "금등풍차해안", xMap:"126.192565364615", yMap: "33.3634370394037"},
//         {name: "곽지해수욕장", xMap:"126.3031045774", yMap: "33.4485353054"},
//         {name: "알작지해변", xMap:"126.4412414879", yMap: "33.4962044339"},
//         {name: "세기알해변", xMap:"126.7563127037", yMap: "33.5577304412"},
//         {name: "세화해변", xMap:"126.8605738644", yMap: "33.5244858032"},
//         {name: "평대해변", xMap:"126.8406003954", yMap: "33.5332400681"},
//         {name: "종달리해변", xMap:"126.90559007394", yMap: "33.4885187698592"},
//         {name: "소금막해변", xMap:"126.841532663", yMap: "33.3340093146"}
//     ];

  const jejuBlues = [
    { id: 1, name: "곽지해수욕장", xMap: "126.3031045774", yMap: "33.4485353054" },
    { id: 2, name: "광치기해변", xMap: "126.9239478125", yMap: "33.4523086956" },
    { id: 3, name: "김녕해수욕장", xMap: "126.7596485488", yMap: "33.5566778337" },
    { id: 4, name: "삼양해수욕장", xMap: "126.5852560795", yMap: "33.5255284819" },
    { id: 5, name: "세기알해변", xMap: "126.7563127037", yMap: "33.5577304412" },
    { id: 6, name: "세화해변", xMap: "126.8605738644", yMap: "33.5244858032" },
    { id: 7, name: "신양섭지해수욕장", xMap: "126.923451955302", yMap: "33.4351402005044" },
    { id: 8, name: "신흥해수욕장", xMap: "126.6485444197", yMap: "33.551979345" },
    { id: 9, name: "알작지해변", xMap: "126.4412414879", yMap: "33.4962044339" },
    { id: 10, name: "월정리해수욕장", xMap: "126.7983896767", yMap: "33.5546536829" },
    { id: 11, name: "이호테우해수욕장", xMap: "126.4531570913", yMap: "33.4974183784" },
    { id: 12, name: "종달리해변", xMap: "126.90559007394", yMap: "33.4885187698592" },
    { id: 13, name: "평대해변", xMap: "126.8406003954", yMap: "33.5332400681" },
    { id: 14, name: "하도해수욕장", xMap: "126.8988152454", yMap: "33.5135348561" },
    { id: 15, name: "한담해변", xMap: "126.3101064260", yMap: "33.4627838378" },
    { id: 16, name: "함덕해수욕장", xMap: "126.6683567720", yMap: "33.5439000013" }
  ];
  
  const seogwipoBlues = [
    { id: 17, name: "금능해수욕장", xMap: "126.2360339355", yMap: "33.3903434702" },
    { id: 18, name: "금등풍차해안", xMap: "126.192565364615", yMap: "33.3634370394037" },
    { id: 19, name: "남원큰엉해변", xMap: "126.703711977934", yMap: "33.2733498193692" },
    { id: 20, name: "논짓물해변", xMap: "126.389195091938", yMap: "33.2373342754443" },
    { id: 21, name: "사계해변", xMap: "126.3084395842", yMap: "33.2282014158" },
    { id: 22, name: "소금막해변", xMap: "126.841532663", yMap: "33.3340093146" },
    { id: 23, name: "신창풍차해안", xMap: "126.1739014935", yMap: "33.3434476863" },
    { id: 24, name: "엉알해안", xMap: "126.1676196819", yMap: "33.2994219009" },
    { id: 25, name: "용머리해안", xMap: "126.3108920241", yMap: "33.2338147237" },
    { id: 26, name: "자구리담수욕장", xMap: "126.569094864082", yMap: "33.2434633730833" },
    { id: 27, name: "중문색달해수욕장", xMap: "126.4112108397", yMap: "33.2454289066" },
    { id: 28, name: "표선해수욕장", xMap: "126.8424244429", yMap: "33.3256630271" },
    { id: 29, name: "하모해수욕장", xMap: "126.2618662177", yMap: "33.2115275274" },
    { id: 30, name: "하효쇠소깍해변", xMap: "126.6231006558", yMap: "33.2521787368" },
    { id: 31, name: "협재해수욕장", xMap: "126.2394418960", yMap: "33.393776477" },
    { id: 32, name: "화순금모래해변", xMap: "126.3335149080", yMap: "33.2407004292" }
  ];
  

const AlongBlues = () => {

    return (
      <div className='page-container'>
        <PageHeader title={"바당따라"}/>
        <Blues jejuBlues={jejuBlues} seogwipoBlues={seogwipoBlues}/>
        <Footer />
      </div>
    );
  };
  
  export default AlongBlues;